In [1]:
import numpy as np
import pandas as pd

In [6]:
d = {'Adeyemi': [1,2,np.nan], 'Ben':[5, np.nan, np.nan], 'Eden': [1,2,3]}

In [7]:
ms = pd.DataFrame(d)
ms

   Adeyemi  Ben  Eden
0      1.0  5.0     1
1      2.0  NaN     2
2      NaN  NaN     3

In [8]:
#dropna() will drop any row will mising values, indicate axis = 1 to remove column

In [11]:
ms.dropna(axis=1)

   Eden
0     1
1     2
2     3

In [10]:
ms

   Adeyemi  Ben  Eden
0      1.0  5.0     1
1      2.0  NaN     2
2      NaN  NaN     3

In [12]:
#thresh to set limit of when to remove the row with missing values

In [17]:
ms

   Adeyemi  Ben  Eden
0      1.0  5.0     1
1      2.0  NaN     2
2      NaN  NaN     3

In [22]:
ms.dropna(thresh=2)   #atleast 2 values must be present in the row

   Adeyemi  Ben  Eden
0      1.0  5.0     1
1      2.0  NaN     2

In [23]:
ms

   Adeyemi  Ben  Eden
0      1.0  5.0     1
1      2.0  NaN     2
2      NaN  NaN     3

In [26]:
ms.fillna(value = 'Yemi' )

  Adeyemi   Ben  Eden
0       1     5     1
1       2  Yemi     2
2    Yemi  Yemi     3

In [28]:
ms['Adeyemi'].fillna(value = ms['Adeyemi'].mean())

0    1.0
1    2.0
2    1.5
Name: Adeyemi, dtype: float64

In [32]:
msnow = ms.fillna(value=ms.mean())

In [34]:
msnow

   Adeyemi  Ben  Eden
0      1.0  5.0     1
1      2.0  5.0     2
2      1.5  5.0     3